config.org
#+title: My Custom Config
#+author: Harsh Vyapari (harshv5094)
#+date: <2024-10-25 Fri>
#+startup: showeverything

* Table Of Contents :toc:
- [[#basic-configuration][Basic Configuration]]
  - [[#beacon-mode][Beacon Mode]]
  - [[#doom-theme][Doom theme]]
  - [[#font-family][Font Family]]
  - [[#relative-line-number][Relative Line Number]]
- [[#org-mode-settings][Org Mode Settings]]
  - [[#org-directory][Org directory]]
- [[#terminal][Terminal]]
  - [[#setting-up-terminal-keybinding][Setting up Terminal Keybinding]]

* Basic Configuration

** Beacon Mode
To find cursor anywhere
#+begin_src emacs-lisp
(beacon-mode 1)
#+end_src

** Doom theme
Setting default theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
#+end_src

** Font Family
Setting default font
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 15 :weight 'regular))
#+end_src

** Relative Line Number
Enable relative line number
#+begin_src emacs-lisp
; NOTE setting relative line number
(setq display-line-numbers-type 'relative)
#+end_src

* Org Mode Settings

** Org directory
Setting different org directories default path default path
#+begin_src emacs-lisp
; NOTE Default Org Directory
(setq org-directory "~/org/")
; NOTE Default Note File
(setq org-default-notes-file (concat org-directory "/refile.org"))
; NOTE Default Org Roam Directory
(setq org-roam-directory "~/notebook/")
#+end_src

* Terminal

** Setting up Terminal Keybinding
#+begin_src emacs-lisp
; NOTE Setting vterm keybinding
(map! :leader
      :desc "Vterm Toggle" "v t" #'+vterm/toggle)
#+end_src
